const QUESTIONS = [
  { id: 1, question: "كم عدد أيام السنة الكبيسة؟", answer: "366 يوم." },
  { id: 2, question: "ما هي الزهرة الوطنية للهند؟", answer: "زهرة اللوتس." },
  { id: 3, question: "ما هي الألوان الأساسية؟", answer: "الأحمر، والأزرق، والأصفر." },
  { id: 4, question: "ما هو أصغر شهر في السنة؟", answer: "فبراير." },
  { id: 5, question: "ما هو اللون الذي يرمز إلى السلام؟", answer: "الأبيض." },
  { id: 6, question: "ما هو الاتجاه الذي تشرق منه الشمس؟", answer: "الشرق." },
  { id: 7, question: "ما هو المكان المعروف باسم سقف العالم؟", answer: "التبت." },
  { id: 8, question: "عدد الولايات الهندية؟", answer: "28." },
  { id: 9, question: "كم عدد السنوات الموجودة في الألفية الواحدة؟", answer: "1000 سنة." },
  { id: 10, question: "كم عدد السنوات في القرن؟", answer: "100 سنة." },
  { id: 11, question: "كم عدد السنوات في العقد؟", answer: "10 سنوات." },
  { id: 12, question: "ما اسم اللعبة الوطنية في أمريكا؟", answer: "البيسبول." },
  { id: 13, question: "كم مليمتر في السنتيمتر؟", answer: "10 مم." },
  { id: 14, question: "ما اسم العالم الذي وضع نظرية النسبية؟", answer: "ألبرت إينشتاين." },
  { id: 15, question: "ما اسم العالم الذي وضع قانون الجاذبية؟", answer: "إسحاق نيوتن." },

  { id: 16, question: "من هو مؤسس الدولة العلمانية في تركيا؟", answer: "مصطفى كمال أتاتورك." },
  { id: 17, question: "من هو مؤسس النهضة الحديثة في مصر؟", answer: "محمد علي باشا." },
  { id: 18, question: "من هو مؤسس الدولة السعودية الحديثة؟", answer: "الملك عبدالعزيز آل سعود." },
  { id: 19, question: "ما هي أول وزارة تكونت في السعودية الحديثة؟", answer: "وزارة الداخلية." },
  { id: 20, question: "ما هو نظام الحكم في إسبانيا؟", answer: "نظام ملكي." },
  { id: 21, question: "ما هو نظام الحكم في بريطانيا؟", answer: "نظام ملكي." },
  { id: 22, question: "ما هو نظام الحكم في الولايات المتحدة؟", answer: "نظام جمهوري قائم على الانتخابات." },
  { id: 23, question: "ما هي أصغر دول الخليج من حيث المساحة؟", answer: "مملكة البحرين." },
  { id: 24, question: "ما هي أغنى دولة خليجية من حيث احتياطي الذهب؟", answer: "السعودية." },
  { id: 25, question: "من هو قائد ثورة 1919م في مصر؟", answer: "سعد زغلول." },
  { id: 26, question: "من هو وزير هيئة الترفيه في السعودية؟", answer: "تركي آل الشيخ." },
  { id: 27, question: "ما هي أكثر سياحة رائجة في السعودية على مر التاريخ؟", answer: "السياحة الدينية." },
  { id: 28, question: "ما هي الدولة العربية التي كان اسمها سابقًا أرض مجان ومزون؟", answer: "عمان." },
  { id: 29, question: "ما هي الدولة التي كانت مقسمة إلى برلين الشرقية والغربية؟", answer: "ألمانيا." },
  { id: 30, question: "من هي الدولة التي اشترت منها أمريكا ولاية ألاسكا؟", answer: "روسيا." },
  { id: 31, question: "ما هي الثورة العُظمى التي غيرت شكل العالم كله في العصر الحديث؟", answer: "الثورة الصناعية." },
  { id: 32, question: "في أي عام تم سن قوانين عمالة الأطفال في أمريكا؟", answer: "1938م." },
  { id: 33, question: "متى بدأ بناء سور الصين العظيم؟", answer: "القرن الـ 7 ق.م." },
  { id: 34, question: "ما اسم آخر قيصر لروسيا؟", answer: "نيكولاس الثاني." },
  { id: 35, question: "متى استقلت ليبيا عن إيطاليا؟", answer: "1951م." },

  { id: 36, question: "ما اسم النهر الذي يمر عبر باريس؟", answer: "نهر السين." },
  { id: 37, question: "ما اسم أكبر بحيرة مائية في أفريقيا؟", answer: "بحيرة فيكتوريا." },
  { id: 38, question: "كم عاصمة لجنوب أفريقيا؟", answer: "ثلاثة (عاصمة تنفيذية، وقضائية، وتشريعية)." },
  { id: 39, question: "ما هي أعمق نقطة في محيطات العالم؟", answer: "خندق ماريانا." },
  { id: 40, question: "ما هي الدولة المشهورة بأنها أرض الألف بحيرة؟", answer: "فنلندا." },
  { id: 41, question: "ما هي الدولة التي عاصمتها بوينس آيرس؟", answer: "الأرجنتين." },
  { id: 42, question: "ما هي الدولة التي عاصمتها كانبيرا؟", answer: "استراليا." },
  { id: 43, question: "ما هي عاصمة الولايات المتحدة؟", answer: "لندن." },
  { id: 44, question: "ما هي عاصمة دولة تايلاند؟", answer: "بانكوك." },
  { id: 45, question: "ما هي عاصمة السويد؟", answer: "ستوكهولم." },
  { id: 46, question: "ما هي عاصمة بلجيكا؟", answer: "بروكسل." },
  { id: 47, question: "ما هي عاصمة أيرلندا؟", answer: "دبلن." },
  { id: 48, question: "ما هو أكبر نظام شعب مرجانية في العالم؟", answer: "الحاجز المرجاني العظيم." },
  { id: 49, question: "ما هي الولايات الأمريكية التي لديها أكبر عدد من البراكين النشطة؟", answer: "ألاسكا." },
  { id: 50, question: "ما هي أطول شلالات في العالم؟", answer: "شلالات أنجل." },
  { id: 51, question: "ما اسم أكبر شبه جزيرة في العالم؟", answer: "شبه الجزيرة العربية." },
  { id: 52, question: "أين توجد القلعة الضائعة (ماتشو بيتشو)؟", answer: "بيرو." },
  { id: 53, question: "ما اسم أكبر الغابات المطيرة في العالم؟", answer: "غابة الأمازون." },
  { id: 54, question: "ما هي الدولة التي تقع في قارة أوروبا وقارة آسيا في آن واحد؟", answer: "تركيا." },
  { id: 55, question: "ما اسم العاصمة الأوروبية المبنية على 14 جزيرة؟", answer: "ستوكهولم في السويد." },

  { id: 56, question: "ما هي الحالات الأربعة للمادة؟", answer: "الصلبة والسائلة والغازية والبلازما." },
  { id: 57, question: "ما هي المدة التي يستغرقها وصول ضوء الشمس إلى كوكب الأرض؟", answer: "8 دقائق تقريبًا." },
  { id: 58, question: "ما هو أطول أنواع العشب البري في العالم؟", answer: "الخيزران." },
  { id: 59, question: "ما اسم العداد الذي يقيس الإشعاع؟", answer: "عداد جايجر." },
  { id: 60, question: "ما هما العنصران اللذان يتكون منهما البرونز؟", answer: "النحاس والقصدير." },
  { id: 61, question: "ما هو عدد قارات العالم؟", answer: "سبعة." },
  { id: 62, question: "ماذا تسمى العملية التي يتحول فيها السائل إلى غاز؟", answer: "التبخر." },
  { id: 63, question: "ما هو اسم مركز الذرة؟", answer: "النواة." },
  { id: 64, question: "ما اسم العلم الذي يهتم بدراسة الكائنات الحية؟", answer: "علم الأحياء." },
  { id: 65, question: "ما هو الشيء الذي تجمعه النحلة من الأزهار؟", answer: "الرحيق." },
  { id: 66, question: "ما اسم الظاهرة التي يتغير فيها اتجاه الضوء عندما ينتقل من وسط لآخر؟", answer: "الانكسار." },
  { id: 67, question: "أي نوع من السحب يرتبط بالعواصف الرعدية؟", answer: "السحب الركامية." },
  { id: 68, question: "كم عدد أرجل جراد البحر؟", answer: "10." },
  { id: 69, question: "ما اسم الحيوان الذي يضع أكبر بيضة؟", answer: "النعامة." },
  { id: 70, question: "كم عدد العظام الموجودة في رقبة الزرافة؟", answer: "سبعة." },
  { id: 71, question: "ما هو الحيوان الذي لسانه يمكنه أن يكون بطول جسمه؟", answer: "الحرباء." },
  { id: 72, question: "ما هو الحيوان الثديي المعروف بأنه صاحب أقوى عضة؟", answer: "فرس النهر." },
  { id: 73, question: "أي عضو في جسم الإنسان بداخله أصغر عظام الجسم؟", answer: "الأذن." },
  { id: 74, question: "ما هو أكبر شريان في جسم الإنسان؟", answer: "الشريان الأورطي." },
  { id: 75, question: "كم عدد براعم التذوق الموجودة في لسان الإنسان؟", answer: "حوالي 10 آلاف برعم." },

  { id: 76, question: "ما هو لون الزمرد؟", answer: "أخضر." },
  { id: 77, question: "أذا تم تجميد الماء فما هو اسمه الجديد؟", answer: "ثلج." },
  { id: 78, question: "كم عدد الكواكب الموجودة في المجموعة الشمسية؟", answer: "8." },
  { id: 79, question: "ما اسم أنثى ميكي ماوس؟", answer: "ميني ماوس." },
  { id: 80, question: "ما هو فيلم ديزني الذي البطلة فيه هي الملكة إلسا؟", answer: "فروزن." },
  { id: 81, question: "أين يعيش سانتا كلوز (بابا نويل)؟", answer: "القطب الشمالي." },
  { id: 82, question: "ما هو الشيء الذي تتحول له اليرقات بمجرد أن تنضج؟", answer: "الفراشات." },
  { id: 83, question: "ما هي الظبية؟", answer: "أنثى الغزال." },
  { id: 84, question: "كم عدد أيام السنة؟", answer: "365 يوم." },
  { id: 85, question: "كم ضلع في المثلث؟", answer: "3." },
  { id: 86, question: "لماذا تسقط الأشياء لأسفل عندما لا نمسك بها؟", answer: "بسبب الجاذبية." },
  { id: 87, question: "ما اسم البطل الخارق الذي يمكنه أن يتسلق الجدران والمباني؟", answer: "سبايدر مان." },
  { id: 88, question: "أي من كواكب المجموعة الشمسية يوجد حوله حلقة؟", answer: "كوكب زحل." },
  { id: 89, question: "ما هو وطن الكنغر؟", answer: "استراليا." },
  { id: 90, question: "ما هو عكس كلمة غالي؟", answer: "رخيص/ زهيد." },
  { id: 91, question: "كم عدد شهور السنة؟", answer: "12." },
  { id: 92, question: "كم عدد أيام شهر فبراير؟", answer: "28 يوم، ويكون 29 كل أربعة سنوات." },
  { id: 93, question: "كم عدد أيام شهر يناير؟", answer: "31 يوم." },
  { id: 94, question: "ما اسك أكبر قارة في العالم؟", answer: "قارة آسيا." },
  { id: 95, question: "ما هو حاصل جمع 8 و 2؟", answer: "10." },

  { id: 96, question: "أين كان يعيش العالم ألبرت إينشتاين قبل انتقاله إلى الولايات المتحدة؟", answer: "ألمانيا." },
  { id: 97, question: "من هو أول حاكم للإمبراطورية المغولية؟", answer: "جنكيز خان." },
  { id: 98, question: "ما هي عاصمة إمبراطورية الإنكا؟", answer: "كوزكو/ كوسكو." },
  { id: 99, question: "كم قرن حكمت أسرة هان الصين؟", answer: "4 قرون." },
  { id: 100, question: "ما هو اسم الإمبراطور الأول لروما القديمة؟", answer: "أغسطس." },
  { id: 101, question: "من هو الملك الذي تم بناء الهرم الأكبر كمقبرة له؟", answer: "الملك خوفو." },
  { id: 102, question: "ما هي البلد التي يوجد فيها هرم الشمس؟", answer: "المكسيك." },
  { id: 103, question: "ما اسم طريق التجارة الذي كان يربط الشرق بالغرب قديمًا؟", answer: "طريق الحرير." },
  { id: 104, question: "ما هو أطول نهر في العالم؟", answer: "نهر النيل." },
  { id: 105, question: "ما هو أطول نهر في آسيا؟", answer: "نهر اليانغتسي." },
  { id: 106, question: "ما هو المكان الأكثر جفافًا على وجه الأرض؟", answer: "صحراء أتاكاما." },
  { id: 107, question: "ما هي أكبر دول أفريقية من حيث عدد السكان؟", answer: "نيجيريا." },
  { id: 108, question: "ما اسم أكبر جزيرة في العالم؟", answer: "جرينلاند." },
  { id: 109, question: "ما هي المدينة المشهورة باسم مهد الديمقراطية؟", answer: "أثينا في اليونان." },
  { id: 110, question: "ما اسم الدولة التي لها ساحل على الخليج العربي وساحل على البحر الأحمر؟", answer: "المملكة العربية السعودية." },
  { id: 111, question: "ما هي القارة التي لا يوجد بها نحل؟", answer: "قارة أنتاركتيكا (القارة القطبية الجنوبية)." },
  { id: 112, question: "ما هي الحدود الطبيعية التي تفصل دولة إسبانيا عن فرنسا؟", answer: "جبال البرانس." },
  { id: 113, question: "ما هي أكبر الولايات مساحة في الهند؟", answer: "راجستان." },
  { id: 114, question: "ما اسم الصحراء التي توجد في شمال غرب الهند؟", answer: "صحراء ثار." },
  { id: 115, question: "ما هي الولاية الهندية المشهورة باسم أرض الأنهار الخمسة؟", answer: "البنجاب." },
  { id: 116, question: "ما هي عاصمة المملكة العربية السعودية؟", answer: "الرياض." },
  { id: 117, question: "ما هي عاصمة الدولة السعودية الأولى؟", answer: "الدرعية." },
  { id: 118, question: "ما هي عاصمة الدولة السعودية الثانية؟", answer: "الرياض." },
  { id: 119, question: "كم سنة استمرت الدولة السعودية الأولى؟", answer: "حوالي 74 سنة." },
  { id: 120, question: "كم سنة استمرت الدولة السعودية الثانية؟", answer: "حوالي 67 سنة." },
  { id: 121, question: "من هو مؤسس الدولة السعودية الثالثة؟", answer: "الملك عبدالعزيز آل سعود." },
  { id: 122, question: "ما اسم السعودية القديم؟", answer: "مملكة الحجاز ونجد وملحقاتها." },
  { id: 123, question: "متى بدأ الملك عبدالعزيز توحيد المملكة بشكل فعلي؟", answer: "عام 1902م." },
  { id: 124, question: "ما هو تاريخ توحيد السعودية على يد الملك عبدالعزيز؟", answer: "1932م." },
  { id: 125, question: "من هو الملك الذي خلف الملك المؤسس عبدالعزيز؟", answer: "الملك سعود بن عبدالعزيز." },
  { id: 126, question: "ما هي البلد التي لجأ إليها الأمير عبدالعزيز آل سعود في المنفى؟", answer: "الكويت وقطر." },
  { id: 127, question: "متى سقطت الدولة السعودية الثانية؟", answer: "عام 1891م." },
  { id: 128, question: "من الذي استحوذ على الحكم بعد سقوط الدولة السعودية الثانية؟", answer: "آل رشيد." },
  { id: 129, question: "ما هو أول بئر بترول اكتشفه الملك عبدالعزيز؟", answer: "بئر الدمام (7)." },
  { id: 130, question: "كم عدد مناطق السعودية؟", answer: "13 منطقة إدارية." },
  { id: 131, question: "كم عدد محافظات السعودية؟", answer: "134 محافظة." },
  { id: 132, question: "كم عدد المعاهدات الخارجية التي أبرمها الملك عبدالعزيز آل سعود؟", answer: "أكثر من 30 معاهدة." },
  { id: 133, question: "ما هي أول وزارة في السعودية؟", answer: "وزارة الخارجية." },
  { id: 134, question: "ما هي الدولة التي أعلنت تأيدها للسعودية قبل إعلان التوحيد بـ 6 سنين؟", answer: "روسيا." },
  { id: 135, question: "ما هي الدول العظمى التي أبرم معها الملك عبدالعزيز اتفاقيات ومعاهدات؟", answer: "الصين، وروسيا." },
  { id: 136, question: "متى تخلصت البحرين من الاحتلال؟", answer: "عام 1861م." },
  { id: 137, question: "متى كانت حرب الكويت والعراق؟", answer: "عام 1990م." },
  { id: 138, question: "من هو حاكم العراق أثناء حرب الكويت والعراق؟", answer: "صدام حسين." },
  { id: 139, question: "ما هي البلاد التي شاركت في العدوان الثلاثي على مصر؟", answer: "بريطانيا، وفرنسا، واسرائيل." },
  { id: 140, question: "متى تأسست دولة قطر؟", answer: "عام 1971م." },
  { id: 141, question: "ما هي الدولة العربية التي لا تزال محتلة حتى الآن؟", answer: "فلسطين." },
  { id: 142, question: "ما الاسم الذي يُطلق على حرب الكويت والعراق؟", answer: "حرب الخليج الثانية." },
  { id: 143, question: "متى كانت حرب الخليج الثانية؟", answer: "عام 1990م." },
  { id: 144, question: "متى تحررت الكويت من غزو العراق؟", answer: "عام 1991م." },
  { id: 145, question: "من هم أطراف النزاع في الحرب الخليجية الأولى؟", answer: "العراق وإيران." },
  { id: 146, question: "متى بدأت حرب الخليج الأولى؟", answer: "عام 1980م." },
  { id: 147, question: "ماذا كان يُطلق على اللبنانيين القدامى؟", answer: "الفينيقيون." },
  { id: 148, question: "ما هي أقصر فترة لحكومة في دولة لبنان الحديثة؟", answer: "حكومة نور الدين الرفاعي؛ حيث دامت حوالي 65 ساعة فقط." },
  { id: 149, question: "ما هي أطول فترة لحكومة لبنانية؟", answer: "حكومة فؤاد السنيورة، واستمرت 1040 يوم." },
  { id: 150, question: "ما هي عدد الحكومات التي مرت على لبنان منذ إعلانها دولة؟", answer: "حوالي 87 حكومة." },
  { id: 151, question: "من هو أول رئيس لمصر بعد سقوط نظام الحكم الملكي؟", answer: "الرئيس محمد نجيب." },
  { id: 152, question: "ما هو نظام الحكم في لبنان؟", answer: "نظام جمهوري." },
  { id: 153, question: "ما هو نظام الحكم في المغرب؟", answer: "نظام ملكي." },
  { id: 154, question: "ما هو نظام الحكم في البحرين؟", answer: "ملكي دستوري وراثي." },
  { id: 155, question: "ما هو نظام الحكم في مصر؟", answer: "نظام جمهوري." },
  { id: 156, question: "متى اندلعت الحرب العالمية الأولى؟", answer: "1914م." },
  { id: 157, question: "متى انتهت الحرب العالمية الأولى؟", answer: "1918م." },
  { id: 158, question: "من هي الدول المنتصرة في الحرب العالمية الأولى؟", answer: "أمريكا وبريطانيا وفرنسا، وبقية دول التحالف." },
  { id: 159, question: "ما هي دول المحور؟", answer: "ألمانيا وإيطاليا واليابان." },
  { id: 160, question: "متى بدأت الحرب العالمية الثانية؟", answer: "1939م." },
  { id: 161, question: "ما هو تاريخ انتهاء الحرب العالمية الثانية؟", answer: "1945م." },
  { id: 162, question: "من هي الدول التي فازت في الحرب العالمية الثانية؟", answer: "أمريكا، والاتحاد السوفيتي، والصين، وفرنسا." },
  { id: 163, question: "ما هي الدولة التي تم ضربها بالنووي في الحرب العالمية الثانية؟", answer: "الإمبراطورية اليابانية." },
  { id: 164, question: "من هو القائد الألماني الذي اضطهد اليهود؟", answer: "هتلر." },
  { id: 165, question: "من هو موسوليني؟", answer: "رئيس إيطاليا." },
  { id: 166, question: "كم سنة استمرت الحرب العالمية الأولى؟", answer: "4 سنوات." },
  { id: 167, question: "كم سنة استمرت الحرب العالمية الثانية؟", answer: "6 سنوات." },
  { id: 168, question: "متى تأسست الأمم المتحدة؟", answer: "عام 1945م." },
  { id: 169, question: "من هو الزعيم الهندي الذي قاد حركة استقلال الهند؟", answer: "مهاتما غاندي." },
  { id: 170, question: "متى خضعت الهند للحكم البريطاني؟", answer: "عام 1858م." },
  { id: 171, question: "متى تم فصل باكستان عن الهند؟", answer: "عام 1947م." },
  { id: 172, question: "ما هي البلد التي تنازع عليها الهند وباكستان؟", answer: "كشمير." },
  { id: 173, question: "من هو القائد المغولي المسلم الذي تزوج أميرة هندية؟", answer: "جلال الدين أكبر." },
  { id: 174, question: "من هو مؤسس الإمبراطورية التيمورية في أفغانستان؟", answer: "تيمو لينك." },
  { id: 175, question: "متى حدث انهيار مركز التجارة العالمي في مانهاتن؟", answer: "11 سبتمبر 2001م." },
  { id: 176, question: "من هو القائد الذي وحد المغول؟", answer: "جنكيز خان." },
  { id: 177, question: "من هو القائد الذي هزم المغول؟", answer: "سيف الدين قطز." },
  { id: 178, question: "من هو مؤسس الدولة الأيوبية؟", answer: "صلاح الدين الأيوبي." },
  { id: 179, question: "من هو مؤسس الدولة الأموية؟", answer: "معاوية بن أبي سفيان." },
  { id: 180, question: "من هو مؤسس الدولة الفاطمية؟", answer: "عبدالله بن الحسين المهدي." },
  { id: 181, question: "من هو مؤسس الدولة العباسية؟", answer: "عبدالله بن محمد." },
  { id: 182, question: "من هو مؤسس الدولة السلجوقية؟", answer: "أبو طالب محمد بن ميكائيل بن سلجوق." },
  { id: 183, question: "من هو مؤسس الدولة العثمانية؟", answer: "عثمان بن أرطغرل." },
  { id: 184, question: "من هو مؤسس الدولة الإخشيدية؟", answer: "محمد طغج." },
  { id: 185, question: "من هو مؤسس الدولة الصفوية؟", answer: "الشاه إسماعيل الأول." },
  { id: 186, question: "من الذي قام بتأسيس الحكم الشيعي في إيران؟", answer: "الشاه إسماعيل الأول." },
  { id: 187, question: "من هو الأب الروحي للشيوعية؟", answer: "كارل ماركس." },
  { id: 188, question: "من الذي قام بتوحيد الشمال والجنوب في مصر القديمة؟", answer: "الملك مينا." },
  { id: 189, question: "من هو مؤسس الإمبراطورية الأكدية؟", answer: "سرجون الأكدي." },
  { id: 190, question: "ما اسم حضارة العراق القديمة؟", answer: "الحضارة السومرية." },
  { id: 191, question: "من هو مؤسس الإمبراطورية الرومانية؟", answer: "الإمبراطور الروماني أوغسطس." },
  { id: 192, question: "ما هو الاسم القديم لمدينة اسطنبول في تركيا؟", answer: "بيزنطة." },
  { id: 193, question: "في عهد أي أسرة تأسس سور الصين العظيم؟", answer: "أسرة تشين." },
  { id: 194, question: "لماذا تم تأسيس سور الصين العظيم؟", answer: "لحماية الصين من غزو القبائل الشمالية كالمغول." },
  { id: 195, question: "من هو مؤسس الإمبراطورية الفارسية؟", answer: "قورش الكبير." },
  { id: 196, question: "من الذي أسس حدائق بابل المعلقة؟", answer: "الملك نبوخذ نصر الثاني." },
  { id: 197, question: "أين نشأت حضارة الأزتيك؟", answer: "بالمكسيك." },
  { id: 198, question: "من هو الملك النجاشي؟", answer: "ملك من ملوك الحبشة." },
  { id: 199, question: "من هو القائد المسلم الذي تم تسمية جبل طارق على اسمه؟", answer: "طارق بن زياد." },
  { id: 200, question: "ما هي المدينة التي فتحها النبي محمد عام 8 هجريًا؟", answer: "مكة المكرمة." },
  { id: 201, question: "من هو قائد جيش فتح بيت المقدس عام 636م؟", answer: "أبو عبيدة بن الجراح." },
  { id: 202, question: "متى دخل عمرو بن العاص مصر؟", answer: "عام 21 هـ." },
  { id: 203, question: "ما هي المعركة التي تم قهر المغول فيها على يد قطز؟", answer: "عين جالوت." },
  { id: 204, question: "من الذي أطلق لقب قطز على القائد سيف الدين قطز؟", answer: "المغول (ومعنى الاسم: الكلب الشرس)." },
  { id: 205, question: "ما هي آخر الغزوات التي خاضها الرسول؟", answer: "غزوة تبوك." },
  { id: 206, question: "من هم خصم المسلمين في غزوة تبوك؟", answer: "الروم." },
  { id: 207, question: "ما هي الغزوة التي خسرها المسلمون بسبب إهمال أوامر الرسول؟", answer: "غزوة أُحد." },
  { id: 208, question: "متى حدثت غزوة بدر؟", answer: "2هـ." },
  { id: 209, question: "من صاحب فكرة حفر الخندق في غزوة الخندق؟", answer: "سلمان الفارسي." },
  { id: 210, question: "من الذي يُنسب إليه قتل الخليفة عمر بن الخطاب؟", answer: "أبو لؤلؤة فيروز الفارسي." },
  { id: 211, question: "من هو والي العراق الذي لُقب بـ “أبي حفص”؟", answer: "عبيدالله بن زياد." },
  { id: 212, question: "أين وقعت موقعة الجمل؟", answer: "في البصرة." },
  { id: 213, question: "من هو أول الخلفاء الراشدين؟", answer: "أبي بكر الصديق." },
  { id: 214, question: "من هو القائد المسلم الذي قام أحد أحفاده بتسليم القدس للصليبيين؟", answer: "صلاح الدين الأيوبي." },
  { id: 215, question: "من الذي فتح الاندلس في العهد الأموي؟", answer: "طارق بن زياد." },
  { id: 216, question: "ما الذي يدل عليه الرمز الكيميائي Ne؟", answer: "عنصر النيون." },
  { id: 217, question: "ما هو الرمز الكيميائي للبيريليوم؟", answer: "Be." },
  { id: 218, question: "ما هو العدد الذري للهيدروجين؟", answer: "1." },
  { id: 219, question: "ما هو العدد الذري للصوديوم؟", answer: "11." },
  { id: 220, question: "ما الذي يدل عليه الرمز الكيميائي P؟", answer: "الفوسفور." },
  { id: 221, question: "ما هو الرمز الكيميائي للتيتانيوم؟", answer: "Ti." },
  { id: 222, question: "ما هو العدد الذري للحديد؟", answer: "26." },
  { id: 223, question: "ما هو الرمز الكيميائي للزرنيخ؟", answer: "As." },
  { id: 224, question: "ما هو الرمز الكيميائي للكوبالت؟", answer: "Co." },
  { id: 225, question: "ما هو الرمز الكيميائي للسيلينيوم؟", answer: "Se." },
  { id: 226, question: "ما هو الرمز الكيميائي للكريبتون؟", answer: "Kr." },
  { id: 227, question: "ما الذي يدل عليه الرمز الكيميائي Ag؟", answer: "الفضة." },
  { id: 228, question: "ما هو الرمز الكيميائي Sn؟", answer: "الرمز الكيميائي لعنصر القصدير." },
  { id: 229, question: "ما هو رمز اليود كيميائيًا؟", answer: "I." },
  { id: 230, question: "ما هو الرمز الكيميائي للذهب؟", answer: "Au." },
  { id: 231, question: "ما هو الرمز الكيميائي للزئبق؟", answer: "Hg." },
  { id: 232, question: "ما هو العدد الذري لعنصر الراديوم؟", answer: "88." },
  { id: 233, question: "ما هو المقصود بالرمز Og؟", answer: "عنصر الأوغانيسون." },
  { id: 234, question: "ما هو الرمز الكيميائي للرصاص؟", answer: "Pb." },
  { id: 235, question: "ما هو العنصر الكيميائي الخاص بالرمز Ce؟", answer: "السيريوم." },
  { id: 236, question: "ما هو الرمز الكيميائي للكربون؟", answer: "S." },
  { id: 237, question: "ما هو الرمز الكيميائي للهيليوم؟", answer: "He." },
  { id: 238, question: "ما هو العدد الذري للكربون؟", answer: "6." },
  { id: 239, question: "ما هو الرمز الكيميائي الخاص بالألومنيوم؟", answer: "Al." },
  { id: 240, question: "ما هو العنصر الذي يدخل في تركيبات الأسنان، ومركزه التاسع من حيث أكثر العناصر وفرة؟", answer: "التيتانيوم." },
  { id: 241, question: "ما هي أنواع الفلزات في الجدول الدوري؟", answer: "قلوية، وأرضية قلوية، وأساسية، وانتقالية." },
  { id: 242, question: "ما هو الرمز الكيميائي للماء؟", answer: "H2o." },
  { id: 243, question: "ما هو الرمز الكيميائي لثاني أكسيد الكبريت؟", answer: "So2." },
  { id: 244, question: "ما هو الاسم الكيميائي للعناصر جيدة التوصيل للحرارة؟", answer: "الفلزات." },
  { id: 245, question: "ما هو الرمز الكيميائي للخارصين؟", answer: "Zn." },
  { id: 246, question: "ما اسم العنصر الكيميائي الذي يتواجد بشكل أساسي في كافة المركبات العضوية؟", answer: "الكربون." },
  { id: 247, question: "ما الاسم الكيميائي للوحدة الهيكلية المكونة من ذرتين هيدروجين وذرة من الكربون؟", answer: "الميثان." },
  { id: 248, question: "ما هي العملية التي تحدث عندما يتفاعل الإيثان مع الـ O2 في الهواء، مع وجود شرارة؟", answer: "الاشتعال/ الاحتراق." },
  { id: 249, question: "ما هو العدد الذري للأكسجين؟", answer: "8." },
  { id: 250, question: "ما المقصود بالعنصر Cr؟", answer: "الكروم." },
  { id: 251, question: "ما هو العنصر الذي عدده الذري 100؟", answer: "الفرميوم." },
  { id: 252, question: "ما هو العنصر الذي عدده الذري 20؟", answer: "الكالسيوم." },
  { id: 253, question: "ما هو العنصر الذي عدده الذري 5؟", answer: "البورون." },
  { id: 254, question: "ما اسم العملية التي يتحول فيها الصلب إلى سائل؟", answer: "الذوبان." },
  { id: 255, question: "ما اسم العملية التي يتحول فيها الصلب إلى غازي؟", answer: "التسامي." },
  { id: 256, question: "ما اسم العملية التي تتحول فيها المادة من الحالة الغازية إلى السائلة؟", answer: "التكثيف." },
  { id: 257, question: "كم عدد عناصر الجدول الذري؟", answer: "118 عنصر." },
  { id: 258, question: "ما اسم العملية الكيميائية التي تفقد فيها المادة إلكترونات، مما يتسبب في زيادة عدد الشحنات الموجبة؟", answer: "عملية الأكسدة." },
  { id: 259, question: "ما هو العنصر الكيميائي الأكثر تواجدًا في نجم الشمس؟", answer: "الهيدروجين." },
  { id: 260, question: "ما الذي يشير له الرمز NaBr؟", answer: "بروميد الصوديوم." },
  { id: 261, question: "ما الذي يشير له المركب الكيميائي NaF؟", answer: "فلوريد الصوديوم." },
  { id: 262, question: "ما الذي يشير إليه الرمز الكيميائي KCl؟", answer: "كلوريد البوتاسيوم." },
  { id: 263, question: "ما هو المركب الكيميائي لحمض الهيدروكلوريك؟", answer: "HCL." },
  { id: 264, question: "ما هو المركب الكيميائي للميثان؟", answer: "CH4." },
  { id: 265, question: "ما هو المركب الكيميائي الدال على الأمونيا؟", answer: "NH3." },
  { id: 266, question: "ما هو المركب الكيميائي لحمض الهيدروكلوريك؟", answer: "HCL." },
  { id: 267, question: "ما هو الرمز الكيميائي لنترات الصوديوم؟", answer: "NaNO3." },
  { id: 268, question: "ما هو الرمز الكيميائي لكبريتات البوتاسيوم؟", answer: "K2SO4." },
  { id: 269, question: "ما هو الرمز الكيميائي للجير الحي؟", answer: "CaO." },
  { id: 270, question: "ما هو الرمز الكيميائي للرخام؟", answer: "CaCO3." },
  { id: 271, question: "ما هي الصيغة الكيميائية لـ “الكين”؟", answer: "cnH2n." },
  { id: 272, question: "ما هو الاسم الشائع للمركب الكيميائي بيكربونات الصوديوم (NaHCO3)؟", answer: "صودا الخبز." },
  { id: 273, question: "ما هي الصيغة الجزيئية للميثان؟", answer: "CH4." },
  { id: 274, question: "ما هي الصيغة الجزيئية لـ “الهكسان”؟", answer: "C6H14." },
  { id: 275, question: "ما هو الاسم الكيميائي لملح الطعام؟", answer: "كلوريد الصوديوم." },
  { id: 276, question: "إلى ماذا يرمز المركب MgCl2؟", answer: "كلوريد المغنيسيوم." },
  { id: 277, question: "إلى ماذا يرمز المركب C2H6O2؟", answer: "الإيثيلين جليكول." },
  { id: 278, question: "ما هو الرمز الكيميائي لسيانيد الفضة؟", answer: "AgCN." },
  { id: 279, question: "ما هو الرمز الكيميائي لأوكسيد الزرنيخ؟", answer: "AsO." },
  { id: 280, question: "إلى أي عنصر يرمز المركب BeO؟", answer: "أوكسيد البريليوم." },
  { id: 281, question: "ما اسم العنصر الكيميائي الذي يدخل في صناعة الأسلاك الكهربائية؟", answer: "النحاس." },
  { id: 282, question: "عندما يتم تسخين الأوكتان على درجة حرارة مرتفعة، وضغط عالي، ينتج كل من البيوتين و….؟", answer: "البيوتان." },
  { id: 283, question: "ما هي الأحماض التي تنتج عن تحلل الأسبرين في جسم الإنسان؟", answer: "الأسيتيك." },
  { id: 284, question: "ما هو الاسم الكيميائي لسكر اللبن؟", answer: "سكر اللاكتوز." },
  { id: 285, question: "ما اسم المركب العضوي الذي يوجد في بول الثدييات؟", answer: "البولينا (اليوريا)." },
  { id: 286, question: "ما هو الاسم العلمي للمشتقات الهالوجينية للألكانات؟", answer: "الفريونات." },
  { id: 287, question: "ما اسم المركب العضوي الذي ينتج عن تخمر المواد السكرية والنشوية؟", answer: "الإيثانول." },
  { id: 288, question: "ما اسم الحمض العضوي الذي يكون سببًا في الوقاية من مرض الأسقربوط؟", answer: "حمض الأسكوربيك." },
  { id: 289, question: "ما هو الاسم الكيميائي للمادة التي تستخدم كمطهر للحروق، ويمكن استخدامها كمادة متفجرة في نفس الوقت؟", answer: "ثلاثي نيترو فينول." },
  { id: 290, question: "ما هو الرمز الكيميائي للمركب ثنائي كلورو ثنائي فينيل ثلاثي كلورو إيثان؟", answer: "DDT." },
  { id: 291, question: "ما هو المركب الذي ينتج من تفاعل البنزين مع الكلور في ظل وجود محفز؟", answer: "كلورو بنزين." },
  { id: 292, question: "ما اسم الرابطة السداسية الموجودة بين ذرات الكربون؟", answer: "الفينول." },
  { id: 293, question: "ما اسم المركب الأليفاتي الذي يتحد من الفينول، فيتكون الباكليت؟", answer: "الأسيتالدهيد." },
  { id: 294, question: "ما اسم المركب الأروماتي التي تتصل فيه حلقة البنزين مباشرةً بمجموعتي الـ “هيدروكسيل”؟", answer: "كاتيكول." },
  { id: 295, question: "ما هو العلم الذي يهتم بدراسة المركبات العضوية؟", answer: "الكيمياء العضوية." },
  { id: 296, question: "ما اسم الحمض الكيميائي الموجود في عصير الليمون؟", answer: "حمض الستريك." },
  { id: 297, question: "ما هو الرمز الكيميائي للعنصر الأكثر وفرة في جسم الإنسان؟", answer: "الأكسجين." },
  { id: 298, question: "ما اسم المذيب الأكثر شهرة في الكيمياء؟", answer: "الماء." },
  { id: 299, question: "ما الاسم الكيميائي للمركب الذي يتم استخدامه كوقود للطائرات؟", answer: "الكيروسين." },
  { id: 300, question: "أي من العناصر الكيميائية يتم استخدامها في صنع أقلام الرصاص؟", answer: "الرصاص (الجرافيت)." },
  { id: 301, question: "ما الاسم الكيميائي للمادة المستخدمة في صناعة الزجاج؟", answer: "السيليكا (الرمل)." },
  { id: 302, question: "ما هو الاسم الدارج للحالة الصلبة لثاني أكسيد الكربون؟", answer: "الثلج الجاف." },
  { id: 303, question: "ما اسم العملية التي يتفاعل فيها القلوي مع الزيوت؟", answer: "التصبن." },
  { id: 304, question: "ما اسم الطاقة التي تقوم بفصل الإلكترون من الذرة؟", answer: "التأين." },
  { id: 305, question: "ما هو العنصر الذي لا يصدأ الحديد بدونه؟", answer: "الأكسجين في وجود الماء." },
  { id: 306, question: "ما هو الرقم الهيدروجيني للماء في حالته النقية؟", answer: "7." },
  { id: 307, question: "ما اسم القانون الذي ينص على أن كمية الغاز التي يتم إذابتها في سائل عليها أن تتناسب مع الضغط الغازي فوق السائل؟", answer: "قانون هنري." },
  { id: 308, question: "ما هو المشروب الذي يدخل حمض الفوسفوريك في صناعته؟", answer: "المشروب الغازي." },
  { id: 309, question: "ما هي الصيغة الكيميائية لغاز الأوزون؟", answer: "O3." },
  { id: 310, question: "ما هي الصيغة الكيميائية للغاز الذي ينتج عن عملية التخمير؟", answer: "Co2 (ثاني أكسيد الكربون)." },
  { id: 311, question: "ما اسم العنصر الكيميائي الذي يدخل في صناعة رقائق الكمبيوتر؟", answer: "السيليكون." },
  { id: 312, question: "ما هو العنصر الذي يتم استخدامه في تنقية المياه؟", answer: "الزيوليت." },
  { id: 313, question: "ما هو العنصر الذي يعتبر أكثر المواد الطبيعية صلابة؟", answer: "الألماس." },
  { id: 314, question: "ما هي الصيغة الكيميائية للفحم النقي؟", answer: "C." },
  { id: 315, question: "ما الاسم الكيميائي الذي يُطلق على حجر اللؤلؤ؟", answer: "كاربونات الكالسيوم." }
];


/*
  يسحب رقم سؤال عشوائي.
  مثال: 74
*/
function drawQuestionNumber() {
  return Math.floor(
    Math.random() * QUESTIONS.length
  ) + 1;
}


/*
  يأخذ رقم السؤال ويجيب السؤال المرتبط به.
*/
function getQuestionById(id) {
  const number = Number(id);

  return QUESTIONS[number - 1] || null;
}


/*
  البوت يسحب الرقم أولاً،
  ثم يستخدم الرقم ليجيب السؤال.
*/
function drawRandomQuestion() {
  const number =
    drawQuestionNumber();

  const question =
    getQuestionById(number);

  return {
    number,
    ...question
  };
}


/*
  ينشئ 4 اختيارات:
  الجواب الصحيح + 3 أجوبة من أسئلة ثانية.
*/
function buildChoices(questionId) {
  const current =
    getQuestionById(questionId);

  if (!current)
    return null;

  const wrongAnswers =
    QUESTIONS
      .filter(
        item =>
          item.id !== current.id &&
          item.answer !== current.answer
      )
      .sort(
        () => Math.random() - 0.5
      )
      .slice(0, 3)
      .map(
        item => item.answer
      );

  const answers = [
    current.answer,
    ...wrongAnswers
  ].sort(
    () => Math.random() - 0.5
  );

  return {
    answers,
    correct:
      answers.indexOf(
        current.answer
      )
  };
}


module.exports = {
  QUESTIONS,
  drawQuestionNumber,
  getQuestionById,
  drawRandomQuestion,
  buildChoices
};
